[
    {
        "id": "UWEHE9tZDvxxNfSW5csq",
        "created": "2026-01-15T02:26:46.330000+00:00",
        "body": "Haven't written to the blog  very recently (I've been [busy](https://en.wikipedia.org/wiki/Procrastination) lately). \n\nJust testing a few new features I implemented to a helper tool I created to maintain this blog.\n\nLooks like it's working pretty [fine](https://en.wikipedia.org/wiki/Catastrophic_failure).",
        "title": "Updates",
        "updated": "2026-01-15T04:10:22.189000+00:00"
    },
    {
        "id": "Uzt4IYKnUcNl318uvLEI",
        "created": "2025-08-10T01:11:02.270000+00:00",
        "body": "Here, I will list what I want to work on for this website\n\n→ Better blog parser (add [links](https://gpsakura.netlify.app), *italics*, **bold**, __underline__ etc.) along with wombo combos like **[bold links](https://gpsakura.netlify.app)**, __[underlined links](https://gpsakura.netlify.app)__ and *[italic links](https://gpsakura.netlify.app)* (yes such thing as ***bold italics*** now)\n\n→ Better mobile blog menu? (prolly nah)\n\n→ More animations\n\n→ USACO Page\n\n→ More content (unsure what)",
        "title": "TODO",
        "updated": "2025-12-23T19:34:50.237000+00:00"
    },
    {
        "id": "X71zS1TlJGmqH2UFVhUu",
        "created": "2025-07-27T21:04:27.199000+00:00",
        "body": "Probably everyone has heard the philosophical question, if you were given the chance to just do everything all over again, would you take it? If all of your past experiences and memories transferred over, I'd say it's a no-brainer to take the second chance. I, for one, have many regrets, not really anything disastrous, but little things that keep me up at night that I'd like to change. In my opinion, the dilemma arises when you lose your memories, or instead are given the choice to live some time in the future. Then, things get a little dicey, since on one hand, more things can go wrong since you have more imperfect knowledge, but on the other, it still is a second chance. Even more complexity is added, since starting on a clean slate means you'll lose connections from your past life,  which leads to a world where those same connections will not or cannot be made.  Is it the right decision to give up your identity and parts of other people's identities just for that secfond chance that may not payout?\n\nYeah, maybe it's time to hop off the Isekais, don't you think?\n\n\"'I don't want this, I'm tired of it' / To tell the truth, I want to say that, too\" - YOASABI, Racing into the Night",
        "title": "Rebirth",
        "updated": "2025-07-27T21:06:02.122000+00:00"
    },
    {
        "id": "alpVph9MJztNoZZ8oKXT",
        "created": "2025-08-14T04:14:32.639000+00:00",
        "body": "The past few days, I learned a little something about Möbius inversions and the resulting computer science with math mashup.\n\nThe premise is simple: exploit the fact that the Dirichlet Inverse of the constant function $1$, which we will simply denote as $1$, is in fact the Möbius function $\\mu$. Okay, maybe its not that simple, but Its pretty interesting getting to understand all of it.\n\nSo what in the world is a Dirichlet Inverse? Well, first, let me introduce the Dirichlet Convolution. I like to think about Dirichlet Convolutions as the arithmetic function equivalent of polynomial multiplication, in that it takes two arithmetic functions and sort of composes them together to produce a different function, of the general form below.\n\n$$(f * g)(n) = \\sum\\limits_{d \\mid n} f(d)\\, g\\!\\left(\\frac{n}{d}\\right)$$\n\nNow, arithmetic functions have an identity element, namely $\\varepsilon$, which returns $1$ for, well $1$, and $0$ for any other positive integer. This is where Dirichlet Inverses come into play, they are a function that, when convoluted with the original function, results in $\\varepsilon$.\n\nNow looping all the way back to Möbius inversions, since the Möbius function is the Dirichlet Inverse of $1$, we arrive at the equality below.\n\n$$\\sum\\limits_{d \\mid n} \\mu(d) \\;=\\; \\varepsilon(n) \\;=\\; [n = 1]$$\n\nIt has surprising uses in computer science. Just to give a simple example, if I want to find all pairs of coprime integers between $1$ and $n$, a naive solution would be to brute force all pairs in $O(n^2)$, but writing the problem into summations and doing some manipulation yields an $O(n)$ solution below.\n\n$$\\sum\\limits_{d=1}^n\\mu(d)\\left\\lfloor\\frac{n}{d}\\right\\rfloor^2$$\n\nNote: the Möbius function $\\mu$ can be precomputed for all numbers from $1$ to $n$ in linear time with a linear sieve, a shadow of how primes are precomputed.\n\nThere are many more applications and computer science problems that can be solved, all outlined in **[this great Codeforces blog](https://codeforces.com/blog/entry/53925)** authored by user Nisiyama_Suzune. Go check it out, for both probably better explanations of the above as well as more in-depth and rigorous definitions and derivations of terms and formulas.",
        "title": "Möbius Inversions",
        "updated": "2025-08-15T03:07:51.518000+00:00"
    },
    {
        "id": "fp0M8Zr3btcFZF2iqQyK",
        "created": "2025-07-22T18:04:07.940000+00:00",
        "body": "Today, I was scrolling through the internet when I came across a colorblind web page filter, which displays webpages as seen through colorblind eyes. Naturally, I decided to plug this page in to see if I was unintentionally trolling, and you'll never guess what I found!\n\nThe website basically only uses shades of black and white, and besides some pretty interesting and ironically colorful tints, there was not that much of a difference. Now that you've successfully been clickbaited, why not drop a nonexistent like on the post to give it some validation! Yes, YouTube has been getting on my nerves these past few days. Time to go create an actual like button!\n\nEdit: I added some generic button at the bottom of each post, but they don't do anything for now, and probably won't display a like count or heart count anytime soon. I'll probably repurpose the heart button into something like a pin button sometime tomorrow lol.\n\n\"So what they say we're colors falling out of line, they don't know the two of us are colorblind, yeah\" - Netrum, Colorblind (ft. Halvorsen)",
        "title": "Colorblind",
        "updated": "2025-11-14T09:21:09.527000+00:00"
    },
    {
        "id": "gAmyhqDeEedTlWRGuqpH",
        "created": "2025-07-21T12:56:00.145000+00:00",
        "body": "Have trouble understanding what $O(n^2)$ represents? Well look no further than MOC Boss HP! For anyone viewing the actual website, no, it is not a bug, it's a feature. As long as the text doesn't go off screen it's fine.\n\nHave you ever wondered why you $\\text{TLE}$ on test case $5$? Well look no further than $4$ second Stygian Onslaught clears! I'm not a degen gambler I promise.",
        "title": "Latex test",
        "updated": "2025-07-22T03:01:40.541000+00:00"
    },
    {
        "id": "iqNMI2iM8R4O4X405fHv",
        "created": "2025-08-01T19:23:50.738000+00:00",
        "body": "It's August, basically a new year, so might as well come up with a resolution.\n\nDon't get behind on stuff, make all deadlines, and make it to next summer in one piece.",
        "title": "Redemption Arc",
        "updated": "2025-08-01T19:23:50.738000+00:00"
    },
    {
        "id": "kafXOk00e3FdHLU5GnLW",
        "created": "2025-07-18T20:14:15.478000+00:00",
        "body": "Infrequent rants will be made about a variety of stuff, I guess.\n\nFrom now on, updates on the website will be posted here, so I suppose this will serve as a sort of patch log. Anyways, I added blog post pinning through the heart button, and I guess the like button is just a \"mark as read\" button or something at this point. I'll probably make pinning look and feel nicer later.\n\nFor some reason, the deployment from GitHub failed because it couldn't find the base directory. I instead just built it locally and deployed it from there and it was completely fine, I'll look into this issue a little bit more.\n\nJust made a dummy commit and it deployed just fine, must've just been a hiccup on Netlify's end.\n\nGiving up on fixing the blog post animation for now, as I can't seem to resolve the rubberbanding that occurs when reordering posts.\n\nEdit: Seems to only rubberband on Firefox, looked around documentation, and it seems Framer just isn't built for a non-Chromium browser like Firefox. I opened an issue on GitHub, but for now, just don't use Firefox to access this site, I guess.\n\nWorking on some blog pagination, the foundation is okay, but animations are still a little janky\n\nCompletely removed vertical transitions, so Firefox issue solved I guess.\n\nSome issues I'll look into are the navbar blocking buttons, and some abnormal CSS on Firefox (again), and ascending/descending sorting control.\n\nOverhauled select menues, so now they fit in much better aesthetics wise.\n\nProbably look at some other issues and/or styling later\n\nFixed navbar conflicts, looking at mobile toggler, it's pretty ugly I'm gonna be real\n\nMobile toggler is done, will try to implement more animations later\n\nAdded a refresh button, which entirely skips animating pinning\n\nAdded color icons for blog posts\n\nMade a save state for blogs, so you don't have to reselect options in the menu\n\nAdded particle networks! First new content of many, will work on an experimental page.\n\nParticle network experiment is up, I'll probably create a custom slider to make it look better\n\nSlider is ready, the number field is ragebait though so I might make *another* custom component just for this particle network\n\nForm component is up, will fix the tick buttons alter\n\nCell automata experiement is up! It's set to the rules of Conway's game of life, but custom rulesets are *probably* coming soon\n\nKnown issues: weird interactions on mobile when dragging (should be a quick fix preventing default actions)\n\nFractals sneakpeek\n\nCell automata now has custom rulesets\n\nAdded dragon curves! (I totally know how they work)\n\nChaotic attractors have been added (finally)\n\nRestored!\n\nPython application development giving me migraines.\n\nRecent USACO gold contest MUST be ragebait.",
        "title": "Announcements",
        "updated": "2026-02-01T06:43:54.202000+00:00"
    },
    {
        "id": "pSGoJCYO5TRbSjHwBfm1",
        "created": "2025-07-22T00:24:00.651000+00:00",
        "body": "I woke up today and found this paragraph that I written for a particular problem: \n\n\"Constraints suggest an $O(n^2)$ solution. It is clear, we construct the answer incrementally, deriving the answer for the $n$ case from the $n-1$ case. Each case should be computed in $O(n)$ time. My initial approach is to keep track of how many removal sequences from the $n-1$ case do not contain a certain token (for example there are $3$ ways to remove tokens for $n=2$ without taking token $1$ across all valid sequences). If you know these numbers, computing the answer for the $n$th case is pretty easy; if we set the $n$th element of the sequence to be fixed, we only need to compute the total number of ways to remove the first $n-1$ tokens that allows the removal of a token from the last closed segment (i.e. the number of removal sequences that leaves a valid token untouched), which can be done with a running sum. By setting the $n$th element to $n$ and making our way down to zero, we can only add on to the number of valid removal sequences (setting the $n$th element to some integer $i\\leq n$ still allows all the ways to remove tokens from setting the $n$th element to $i+1$). The problem is we need to recompute the number of sequences that do not contain a certain number for the $n$th case. This is difficult because although if you take a token $i$ from the last closed segment, you know the resulting removal sequences contains $i$, but otherwise, you can not be sure (taking token $2$ does not guarantee that token $1$ is or isn't present anymore). A brute force solution would be using bitmasks to represent which numbers are \"empty\" but off course the size constraints does not allow for that.\"\n\nThe problem is from a recent Codeforces contest, specifically Round 1035 Division 2 Problem D. It turns out it was a much simpler dp, though it was incremental which I'll take as a win, considering this was a product of my sleepless mind at $2$ am. I just realized I NEED to add an actual text editor/parser instead of cramming everything into one line, because the readability of this blob of text is shaping up to be a DEFCON 1 level threat. ",
        "title": "Goofy problem",
        "updated": "2025-07-22T00:24:00.827000+00:00"
    },
    {
        "id": "pythonupdates",
        "created": "2026-01-30T03:48:37.696000+00:00",
        "body": "I have been working on a Pytohn program that will allow me to more easily read and write to a Firebase where these blog posts are stored. \n\nProgress updates will be posted here I guess.\n\n[link](https://github.com/Soulless9801/blog) if anyone wants to take a peek lol.\n\nDocument ID generation is no longer random, yay! (this should've been present long ago but I'm lazy)",
        "title": "Python Updates",
        "updated": "2026-01-30T03:54:20.215000+00:00"
    },
    {
        "id": "x3hRWMr202NG30TL7BE2",
        "created": "2025-08-11T03:57:10.891000+00:00",
        "body": "**[Codeforces Round 1041, Problem F](https://codeforces.com/contest/2127/problem/F)**\n\nOne key observation, for a given array $a$ with $\\text{max}(a) = m$, imagine it as a lop instead of a linear array. $f(a)$ is the sum of $a[k] - a[k + 1]$ for indices $k$ where $a[k] = m$. \n\nNow from a valid snake sequence you can \"spin\" the array until the last element once again equals $m$, satisfying the snake condition, and of course $f(a)$ evaluates the same.\n\nSo simple game plan, sum up $f(a)$ multiplied by number of elements in the sequence equal to the max element across all valid snake sequences of length $n$ and sum $m$. This is a very naive solution, so we'll probably have to abuse something like the sum being equal to $m$.\n\nTurns out you abuse the solution to a sub problem, denote it as $g(n,m,x)$, representing the number of sequences with length $n$, sum $m$, and all elements $\\leq x$, computed in essentially $O(\\text{log}m)$ time. \n\nWe will fix the maximum, and use only **two** calculations of $g$ for each iteration, resulting in a runtime of $O(m\\text{log}m)$.\n\nTo calculate the total number of maximums present across all possible sequences, you abuse the subproblem to determine the number of sequences with one maximum at the end, and also the number of sequences with at least two maxima (for other maximum besides the last element of the array). You multiply each by $x$, the maximum, and also multiply the second case by $n-1$ to account for the different positions the second maxima can have.\n\nNow for the elements subtracted (the ones next to the maxima), you can once again abuse the __same subproblem__.\n\nLeveraging the observation that across all snake sequences, the sum of the elements at the $i$th index will be the same regardless of $i$, you can easily calculate the sum of the first elements across all sequences with the first subproblem. \n\nFor any of the \"middle\" elements, you just use the __ second subproblem__ with at least two maxima present and the previous observation to arrive at the total sum for those elements. In fact you don't have to compute them individually and sum them up, you can just compute all of them in one lump, since you can \"move\" the second maxima through the entire sequence, making each element besides the two maxima to the right of the second maxima at some point.\n\nThe last element is actually the easiest in my opinion: you can abuse the second subproblem mentioned __once again__, as well as leveraging the fact that it must be equal to the maximum (basically adjusting for overcount in a way).\n\nFinally, summing and subtracting these various cases leads to our final answer. I might consider writing it all out sometime later.",
        "title": "Problem Rant",
        "updated": "2025-08-11T06:20:29.167000+00:00"
    }
]